In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('datafile.csv')

### replacing the values in education column to high and low

In [3]:
df['education'] = df['education'].replace('Bachelors','high')
df['education'] = df['education'].replace('Masters','high')
df['education'] = df['education'].replace('Doctorate','high')
for i in df['education']:
    if i != 'high':
        df['education']=df['education'].replace(i, 'low')

### creating two new columns in the dataframe representing the education type among with the salary amount

In [4]:
df['advanced education']=df['education']+df['salary']

In [5]:
df['non advanced education']= df['advanced education']
df=df.drop(['education-num', 'capital-gain', 'capital-loss', 'fnlwgt'] ,axis=1)

### creating a new dataframe consisting of the two columns created earlier

In [6]:
newdf=df[["advanced education","non advanced education"]].copy()

### replacing the "low education" records in the advanced education column

In [7]:
newdf['advanced education']=newdf['advanced education'].replace('low<=50K', '')
newdf['advanced education']=newdf['advanced education'].replace('low>50K', '')

### replacing the "high education" records in the non advanced education column

In [8]:
newdf['non advanced education']=newdf['non advanced education'].replace('high<=50K', '')
newdf['non advanced education']=newdf['non advanced education'].replace('high>50K', '')

### separating the new dataframe into two seprate dataframes to remove the empty strings and check the percentages

In [9]:
newdf1=newdf['advanced education']
dataframe1=newdf1.to_frame()
dataframe1['advanced education']= dataframe1[dataframe1['advanced education'] != '']
dataframe1=dataframe1.dropna()

In [10]:
newdf2=newdf['non advanced education']
dataframe2=newdf2.to_frame()
dataframe2['non advanced education']= dataframe2[dataframe2['non advanced education'] != '']
dataframe2=dataframe2.dropna()

In [11]:
dataframe1['advanced education'].value_counts(normalize=True).mul(100).round(1).astype(str)+"%"

high<=50K    52.7%
high>50K     47.3%
Name: advanced education, dtype: object

In [12]:
dataframe2['non advanced education'].value_counts(normalize=True).mul(100).round(1).astype(str)+"%"

low<=50K    81.8%
low>50K     18.2%
Name: non advanced education, dtype: object

### creating a new dataframes using the percentages resulted from the previous step
#### this is mainly done to reduce the time dash takes to process the dataframe

In [13]:
advlst=[]
nadvlst=[]
for i in range(527):
    advlst.append('<50K')
for i in range(473):
    advlst.append('>50K')


for i in range(818):
    nadvlst.append('<50K')
for i in range(182):
    nadvlst.append('>50K')

In [14]:
sarray=np.column_stack((advlst, nadvlst))

In [15]:
thedf=pd.DataFrame(data=sarray, columns=['advanced education salary', 'non advanced education salary'])

In [16]:
thedf.head()

  advanced education salary non advanced education salary
0                      <50K                          <50K
1                      <50K                          <50K
2                      <50K                          <50K
3                      <50K                          <50K
4                      <50K                          <50K

In [17]:
thedf.to_csv('pie1.csv')

### checking the race counts

In [18]:
tdf=pd.read_csv('datafile.csv')
tdf['race'].value_counts()

White                 25926
Black                  2815
Asian-Pac-Islander      894
Amer-Indian-Eskimo      286
Name: race, dtype: int64

### checking the average age of men in the dataframe

In [19]:
tdf.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [20]:
ttdf=tdf
ttdf=ttdf[ttdf['sex']== 'Male']
ttdf['age'].mean().round()

39.0

In [21]:
ttdf.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
7,52,Self-emp-not-inc,209642,HS-grad,9,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,45,United-States,>50K

### checking education percentages

In [22]:
tdf['education'].value_counts(normalize=True).mul(100).round(1).astype(str)+"%"

HS-grad         32.6%
Some-college    22.2%
Bachelors       16.8%
Masters          5.4%
Assoc-voc        4.3%
11th             3.5%
Assoc-acdm       3.3%
10th             2.7%
7th-8th          1.8%
Prof-school      1.8%
9th              1.5%
Doctorate        1.2%
12th             1.2%
5th-6th          0.9%
1st-4th          0.5%
Preschool        0.1%
Name: education, dtype: object

### creating the required dataframes and saving them to csv files for use in dash

In [23]:
pie_df=tdf['race'].value_counts().to_frame()
pie_df=pie_df.rename(columns={'race':'count'})
pie_df['index']=[0, 1, 2, 3]
pie_df.set_index('index')
pie_df['race']=['White', 'Black', 'Asian', 'Indian']

In [24]:
pie_df.to_csv('pie_df.csv')

In [25]:
bar_df=tdf['education'].value_counts().to_frame()
bar_df=bar_df.rename(columns={'education':'count'})
bar_df['education']=['HS-grad', 'Some-college', 'Bachelors', 'Masters', 'Assoc-voc', '11th', 'Assoc-acdm', '10th', '7th-8th', 'Prof-school', '9th', 'Doctorate', '12th', '5th-6th', '1st-4th', 'Preschool']
bar_df['index']=[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
bar_df=bar_df.set_index('index')

In [26]:
bar_df.to_csv('bar_df.csv')

In [27]:
d={'education':['Advanced', 'Non_Advanced'],'>50K':[47.3, 18.2], '<50K':[52.7, 81.8]}
stacked_df=pd.DataFrame(d)

In [28]:
stacked_df.to_csv('stacked_df.csv')